HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxPort_bf.h
/** \\brief  Length for Ifx_P_OMR_Bits.PCL15 */
#define IFX_P_OMR_PCL15_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PCL15 */
#define IFX_P_OMR_PCL15_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PCL15 */
#define IFX_P_OMR_PCL15_OFF (31)

/** \\brief  Length for Ifx_P_OMR_Bits.PCL1 */
#define IFX_P_OMR_PCL1_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PCL1 */
#define IFX_P_OMR_PCL1_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PCL1 */
#define IFX_P_OMR_PCL1_OFF (17)

/** \\brief  Length for Ifx_P_OMR_Bits.PCL2 */
#define IFX_P_OMR_PCL2_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PCL2 */
#define IFX_P_OMR_PCL2_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PCL2 */
#define IFX_P_OMR_PCL2_OFF (18)

/** \\brief  Length for Ifx_P_OMR_Bits.PCL3 */
#define IFX_P_OMR_PCL3_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PCL3 */
#define IFX_P_OMR_PCL3_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PCL3 */
#define IFX_P_OMR_PCL3_OFF (19)

/** \\brief  Length for Ifx_P_OMR_Bits.PCL4 */
#define IFX_P_OMR_PCL4_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PCL4 */
#define IFX_P_OMR_PCL4_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PCL4 */
#define IFX_P_OMR_PCL4_OFF (20)

/** \\brief  Length for Ifx_P_OMR_Bits.PCL5 */
#define IFX_P_OMR_PCL5_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PCL5 */
#define IFX_P_OMR_PCL5_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PCL5 */
#define IFX_P_OMR_PCL5_OFF (21)

/** \\brief  Length for Ifx_P_OMR_Bits.PCL6 */
#define IFX_P_OMR_PCL6_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PCL6 */
#define IFX_P_OMR_PCL6_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PCL6 */
#define IFX_P_OMR_PCL6_OFF (22)

/** \\brief  Length for Ifx_P_OMR_Bits.PCL7 */
#define IFX_P_OMR_PCL7_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PCL7 */
#define IFX_P_OMR_PCL7_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PCL7 */
#define IFX_P_OMR_PCL7_OFF (23)

/** \\brief  Length for Ifx_P_OMR_Bits.PCL8 */
#define IFX_P_OMR_PCL8_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PCL8 */
#define IFX_P_OMR_PCL8_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PCL8 */
#define IFX_P_OMR_PCL8_OFF (24)

/** \\brief  Length for Ifx_P_OMR_Bits.PCL9 */
#define IFX_P_OMR_PCL9_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PCL9 */
#define IFX_P_OMR_PCL9_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PCL9 */
#define IFX_P_OMR_PCL9_OFF (25)

/** \\brief  Length for Ifx_P_OMR_Bits.PS0 */
#define IFX_P_OMR_PS0_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PS0 */
#define IFX_P_OMR_PS0_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PS0 */
#define IFX_P_OMR_PS0_OFF (0)

/** \\brief  Length for Ifx_P_OMR_Bits.PS10 */
#define IFX_P_OMR_PS10_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PS10 */
#define IFX_P_OMR_PS10_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PS10 */
#define IFX_P_OMR_PS10_OFF (10)

/** \\brief  Length for Ifx_P_OMR_Bits.PS11 */
#define IFX_P_OMR_PS11_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PS11 */
#define IFX_P_OMR_PS11_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PS11 */
#define IFX_P_OMR_PS11_OFF (11)

/** \\brief  Length for Ifx_P_OMR_Bits.PS12 */
#define IFX_P_OMR_PS12_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PS12 */
#define IFX_P_OMR_PS12_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PS12 */
#define IFX_P_OMR_PS12_OFF (12)

/** \\brief  Length for Ifx_P_OMR_Bits.PS13 */
#define IFX_P_OMR_PS13_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PS13 */
#define IFX_P_OMR_PS13_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PS13 */
#define IFX_P_OMR_PS13_OFF (13)

/** \\brief  Length for Ifx_P_OMR_Bits.PS14 */
#define IFX_P_OMR_PS14_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PS14 */
#define IFX_P_OMR_PS14_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PS14 */
#define IFX_P_OMR_PS14_OFF (14)

/** \\brief  Length for Ifx_P_OMR_Bits.PS15 */
#define IFX_P_OMR_PS15_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PS15 */
#define IFX_P_OMR_PS15_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PS15 */
#define IFX_P_OMR_PS15_OFF (15)

/** \\brief  Length for Ifx_P_OMR_Bits.PS1 */
#define IFX_P_OMR_PS1_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PS1 */
#define IFX_P_OMR_PS1_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PS1 */
#define IFX_P_OMR_PS1_OFF (1)

/** \\brief  Length for Ifx_P_OMR_Bits.PS2 */
#define IFX_P_OMR_PS2_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PS2 */
#define IFX_P_OMR_PS2_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PS2 */
#define IFX_P_OMR_PS2_OFF (2)

/** \\brief  Length for Ifx_P_OMR_Bits.PS3 */
#define IFX_P_OMR_PS3_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PS3 */
#define IFX_P_OMR_PS3_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PS3 */
#define IFX_P_OMR_PS3_OFF (3)

/** \\brief  Length for Ifx_P_OMR_Bits.PS4 */
#define IFX_P_OMR_PS4_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PS4 */
#define IFX_P_OMR_PS4_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PS4 */
#define IFX_P_OMR_PS4_OFF (4)

/** \\brief  Length for Ifx_P_OMR_Bits.PS5 */
#define IFX_P_OMR_PS5_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PS5 */
#define IFX_P_OMR_PS5_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PS5 */
#define IFX_P_OMR_PS5_OFF (5)

/** \\brief  Length for Ifx_P_OMR_Bits.PS6 */
#define IFX_P_OMR_PS6_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PS6 */
#define IFX_P_OMR_PS6_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PS6 */
#define IFX_P_OMR_PS6_OFF (6)

/** \\brief  Length for Ifx_P_OMR_Bits.PS7 */
#define IFX_P_OMR_PS7_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PS7 */
#define IFX_P_OMR_PS7_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PS7 */
#define IFX_P_OMR_PS7_OFF (7)

/** \\brief  Length for Ifx_P_OMR_Bits.PS8 */
#define IFX_P_OMR_PS8_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PS8 */
#define IFX_P_OMR_PS8_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PS8 */
#define IFX_P_OMR_PS8_OFF (8)

/** \\brief  Length for Ifx_P_OMR_Bits.PS9 */
#define IFX_P_OMR_PS9_LEN (1)

/** \\brief  Mask for Ifx_P_OMR_Bits.PS9 */
#define IFX_P_OMR_PS9_MSK (0x1)

/** \\brief  Offset for Ifx_P_OMR_Bits.PS9 */
#define IFX_P_OMR_PS9_OFF (9)

/** \\brief  Length for Ifx_P_OMSR0_Bits.PS0 */
#define IFX_P_OMSR0_PS0_LEN (1)

